<?php

return [
    'admin' => [
        'sales' => [
            'orders' => [
                'cancel-success' => 'Замовлення успішно скасоване.',

                'error' => [
                    'cancel-error' => 'Замовлення не може бути скасоване.',
                ],
            ],

            're-order' => [
                'address-create-success'  => 'Адресу успішно збережено',
                'address-not-available'   => 'Доступних методів доставки немає.',
                'create'                  => 'Товар успішно додано до кошика',
                'error'                   => 'Щось пішло не так!',
                'order-create-success'    => 'Замовлення успішно зроблено.',
                'payment-create-success'  => 'Метод оплати успішно збережено',
                'shipping-create-success' => 'Метод доставки успішно збережено',
            ],

            'invoices' => [
                'create-success' => 'Рахунок успішно додано.',

                'error' => [
                    'creation-error'    => 'Створення рахунку для замовлення не дозволено.',
                    'invalid-qty-error' => 'Ми виявили недійсну кількість товарів для виставлення рахунку.',
                    'product-error'     => 'Рахунок не може бути створений без товарів.',
                ],
            ],

            'shipments' => [
                'create-success' => 'Відвантаження успішно додане.',

                'error' => [
                    'creation-error'    => 'Відвантаження не може бути створене для цього замовлення.',
                    'invalid-qty-error' => 'Ми виявили недійсну кількість товарів для відвантаження.',
                ],
            ],

            'refunds' => [
                'create-success' => 'Повернення успішно додане.',

                'error' => [
                    'creation-error'       => 'Повернення не може бути створене для цього замовлення.',
                    'invalid-amount-error' => 'Сума повернення повинна бути не нульовою.',
                    'invalid-qty-error'    => 'Ми виявили недійсну кількість товарів для повернення.',
                    'limit-error'          => 'Максимальна сума, доступна для повернення, становить :amount.',
                ],
            ],

            'transactions' => [
                'already-paid'               => 'Цей рахунок вже оплачений.',
                'invoice-missing'            => 'Цей ідентифікатор рахунку не існує.',
                'transaction-amount-exceeds' => 'Вказана сума цієї транзакції перевищує загальну суму рахунку.',
                'transaction-saved'          => 'Транзакцію збережено.',
            ],
        ],

        'catalog' => [
            'products' => [
                'create-success' => 'Товар успішно додано.',
                'delete-success' => 'Товар успішно видалено.',
                'update-success' => 'Товар успішно оновлено.',

                'inventories' => [
                    'update-success' => 'Запаси успішно оновлено.',
                ],

                'mass-operations' => [
                    'delete-success' => 'Вибрані товари успішно видалено.',
                    'update-success' => 'Вибрані товари успішно оновлено.',
                ],

                'error' => [
                    'configurable-error' => 'Будь ласка, виберіть принаймні один налаштований атрибут.',
                ],
            ],

            'categories' => [
                'create-success'       => 'Категорія успішно додана.',
                'delete-success'       => 'Категорія успішно видалена.',
                'root-category-delete' => 'Кореневу категорію не можна видалити.',
                'update-success'       => 'Категорія успішно оновлена.',
                'not-exist'            => 'Категорія не знайдена.',

                'mass-operations' => [
                    'delete-success' => 'Вибрані категорії успішно видалено.',
                    'update-success' => 'Вибрані категорії успішно оновлено.',
                ],
            ],

            'attributes' => [
                'create-success' => 'Атрибут успішно додано.',
                'delete-success' => 'Атрибут успішно видалено.',
                'update-success' => 'Атрибут успішно оновлено.',

                'error' => [
                    'cannot-change-type'       => 'Не можна змінити тип поля.',
                    'system-attributes-delete' => 'Не можна видалити системні атрибути.',

                    'mass-operations' => [
                        'resource-not-found' => 'Вибрані атрибути не знайдені.',
                    ],
                ],
            ],

            'families'   => [
                'create-success' => 'Сімейство успішно додано.',
                'delete-success' => 'Сімейство успішно видалено.',
                'update-success' => 'Сімейство успішно оновлено.',

                'error' => [
                    'being-used'       => 'Цей ресурс сімейств використовується в :source.',
                    'can-not-updated'  => 'Код не може бути оновлений',
                    'last-item-delete' => 'Потрібно принаймні одне сімейство.',
                ],
            ],
        ],

        'customers' => [
            'customers' => [
                'create-success' => 'Клієнт успішно доданий.',
                'delete-success' => 'Клієнт успішно видалений.',
                'update-success' => 'Клієнт успішно оновлений.',

                'mass-operations' => [
                    'delete-success' => 'Вибрані клієнти успішно видалені.',
                    'update-success' => 'Вибрані клієнти успішно оновлені.',
                ],

                'error' => [
                    'order-pending-account-delete' => 'Не можна видалити обліковий запис клієнта, оскільки деякі замовлення очікують або знаходяться в стані обробки.',
                ],

                'notes' => [
                    'note-taken' => 'Запис взято.',
                ],
            ],

            'addresses' => [
                'create-success' => 'Адреса успішно додана.',
                'delete-success' => 'Адреса успішно видалена.',
                'update-success' => 'Адреса успішно оновлена.',

                'mass-operations' => [
                    'delete-success' => 'Вибрані адреси успішно видалені.',
                ],
            ],

            'groups' => [
                'create-success' => 'Групу клієнтів успішно додано.',
                'delete-success' => 'Групу клієнтів успішно видалено.',
                'update-success' => 'Групу клієнтів успішно оновлено.',

                'error' => [
                    'being-used'           => 'Цей ресурс груп використовується в Клієнтах.',
                    'default-group-delete' => 'Неможливо видалити групу за замовчуванням.',
                ],
            ],

            'reviews' => [
                'delete-success' => 'Відгук успішно видалено.',
                'update-success' => 'Відгук успішно оновлено.',

                'mass-operations' => [
                    'delete-success' => 'Вибрані відгуки успішно видалено.',
                    'update-success' => 'Вибрані відгуки успішно оновлено.',
                ],
            ],

            'news-letter' => [
                'create-success'  => 'Ви успішно підписалися на нашу розсилку.',
                'warning-message' => 'Ви вже підписалися на нашу розсилку.',
            ],
        ],

        'cms' => [
            'create-success' => 'CMS успішно додано.',
            'delete-success' => 'CMS успішно видалено.',
            'update-success' => 'CMS успішно оновлено.',

            'mass-operations' => [
                'delete-success' => 'Вибрані сторінки успішно видалено.',
            ],

            'error' => [
                'already-taken' => 'Ці сторінки вже зайняті.',
            ],
        ],

        'marketing' => [
            'communications' => [
                'campaigns' => [
                    'create-success' => 'Кампанію успішно додано.',
                    'delete-success' => 'Кампанію успішно видалено.',
                    'update-success' => 'Кампанію успішно оновлено.',
                ],

                'events' => [
                    'create-success' => 'Подію успішно додано.',
                    'delete-success' => 'Подію успішно видалено.',
                    'update-success' => 'Подію успішно оновлено.',
                ],

                'templates' => [
                    'create-success' => 'Шаблон електронної пошти успішно додано.',
                    'delete-success' => 'Шаблон електронної пошти успішно видалено.',
                    'update-success' => 'Шаблон електронної пошти успішно оновлено.',
                ],

                'subscribers' => [
                    'delete-success' => 'Підписка на розсилку успішно видалена',
                    'update-failed'  => 'Не вдалося оновити підписку на розсилку',
                    'update-success' => 'Підписка на розсилку успішно оновлена',
                ],
            ],

            'promotions' => [
                'cart-rules' => [
                    'create-success' => 'Правило корзини успішно додано.',
                    'delete-success' => 'Правило корзини успішно видалено.',
                    'update-success' => 'Правило корзини успішно оновлено.',
                ],

                'catalog-rules' => [
                    'create-success' => 'Правило каталогу успішно додано.',
                    'delete-success' => 'Правило каталогу успішно видалено.',
                    'update-success' => 'Правило каталогу успішно оновлено.',
                ],

                'cart-rule-coupons' => [
                    'create-success' => 'Купон для правила кошика успішно додано.',
                    'delete-success' => 'Купон для правила кошика успішно видалено.',
                    'update-success' => 'Купон для правила кошика успішно оновлено.',

                    'mass-operations' => [
                        'delete-success' => 'Купони правила кошика успішно видалено'
                    ]
                ],
            ],

            'search-seo' => [
                'url-rewrites' => [
                    'create-success'  => 'Перенаправлення URL успішно додано.',
                    'delete-success'  => 'Перенаправлення URL успішно видалено.',
                    'update-success'  => 'Перенаправлення URL успішно оновлено.',

                    'mass-operations' => [
                        'delete-success' => 'Перенаправлення URL успішно видалено.',
                    ],
                ],

                'search-terms' => [
                    'create-success'  => 'Пошукові терміни успішно додано.',
                    'delete-success'  => 'Пошукові терміни успішно видалено.',
                    'update-success'  => 'Пошукові терміни успішно оновлено.',

                    'mass-operations' => [
                        'delete-success' => 'Пошукові терміни успішно видалено.',
                    ],
                ],

                'search-synonyms' => [
                    'create-success'  => 'Синоніми пошуку успішно додано.',
                    'delete-success'  => 'Синоніми пошуку успішно видалено.',
                    'update-success'  => 'Синоніми пошуку успішно оновлено.',

                    'mass-operations' => [
                        'delete-success' => 'Синоніми пошуку успішно видалено.',
                    ],
                ],

                'sitemaps' => [
                    'create-success' => 'Картки сайтів успішно створено.',
                    'delete-success' => 'Картки сайтів успішно видалено.',
                    'update-success' => 'Картки сайтів успішно оновлено.',
                ],
            ],
        ],

        'settings' => [
            'locales' => [
                'create-success' => 'Мову успішно додано.',
                'delete-success' => 'Мову успішно видалено.',
                'update-success' => 'Мову успішно оновлено.',

                'error' => [
                    'last-item-delete' => 'Потрібна принаймні одна мова.',
                ],
            ],

            'currencies' => [
                'create-success' => 'Валюту успішно додано.',
                'delete-success' => 'Валюту успішно видалено.',
                'update-success' => 'Валюту успішно оновлено.',

                'error' => [
                    'last-item-delete' => 'Потрібна принаймні одна валюта.',
                ],
            ],

            'exchange-rates' => [
                'create-success' => 'Курс обміну успішно додано.',
                'delete-success' => 'Курс обміну успішно видалено.',
                'update-success' => 'Курс обміну успішно оновлено.',
            ],

            'inventory-sources' => [
                'create-success'   => 'Джерело інвентаризації успішно додано.',
                'delete-success'   => 'Джерело інвентаризації успішно видалено.',
                'update-success'   => 'Джерело інвентаризації успішно оновлено.',

                'error' => [
                    'last-item-delete' => 'Потрібне принаймні одне джерело інвентаризації.',
                ],
            ],

            'taxes' => [
                'tax-rates' => [
                    'create-success' => 'Ставку податку успішно додано.',
                    'delete-success' => 'Ставку податку успішно видалено.',
                    'update-success' => 'Ставку податку успішно оновлено.',
                ],

                'tax-categories' => [
                    'create-success' => 'Категорію податку успішно додано.',
                    'delete-success' => 'Категорію податку успішно видалено.',
                    'error'          => 'Один або кілька податкових ставок не існують.',
                    'update-success' => 'Категорію податку успішно оновлено.',
                ],
            ],

            'channels' => [
                'create-success' => 'Канал успішно додано.',
                'delete-success' => 'Канал успішно видалено.',
                'update-success' => 'Канал успішно оновлено.',

                'error' => [
                    'last-item-delete' => 'Потрібен принаймні один канал.',
                ],
            ],

            'users' => [
                'create-success' => 'Користувача успішно додано.',
                'delete-success' => 'Користувача успішно видалено.',
                'update-success' => 'Користувача успішно оновлено.',

                'error' => [
                    'cannot-change-column' => 'Не можна змінити користувачів.',
                    'last-item-delete'     => 'Потрібен принаймні один користувач.',
                ],
            ],

            'roles' => [
                'create-success' => 'Роль успішно додана.',
                'delete-success' => 'Роль успішно видалена.',
                'update-success' => 'Роль успішно оновлена.',

                'error' => [
                    'being-used'       => 'Цей ресурс ролей використовується у користувача адміністратора.',
                    'last-item-delete' => 'Потрібна принаймні одна роль.',
                ],
            ],

            'themes' => [
                'create-success' => 'Тема успішно створена',
                'delete-success' => 'Тема успішно видалена',
                'update-success' => 'Тема успішно оновлена',
            ],
        ],

        'configuration' => [
            'create-success' => 'Конфігурацію успішно додано.',
            'delete-success' => 'Конфігурацію успішно видалено.',
            'update-success' => 'Конфігурацію успішно оновлено.',
        ],

        'account' => [
            'create-success'     => 'Обліковий запис успішно додано.',
            'delete-success'     => 'Обліковий запис успішно видалено.',
            'logged-in-success'  => 'Успішний вхід.',
            'logged-out-success' => 'Успішний вихід.',
            'update-success'     => 'Обліковий запис успішно оновлено.',

            'error' => [
                'credential-error'  => 'Надані облікові дані невірні.',
                'invalid'           => 'Недійсна електронна пошта або пароль.',
                'password-mismatch' => 'Поточний пароль не відповідає.',
            ],
        ],

        'errors' => [
            '404' => [
                'message' => 'Упс! Сторінку, яку ви шукаєте, відпочиває. Здається, ми не можемо знайти те, що ви шукаєте.',
                'title'   => '404 Сторінка не знайдена',
            ],

            '401' => [
                'message' => 'Упс! Здається, вам не дозволено доступ до цієї сторінки. Виглядає, що вам не вистачає необхідних облікових даних.',
                'title'   => '401 Не авторизовано',
            ],

            '403' => [
                'message' => 'Упс! Ця сторінка закрита для вас. Здається, у вас немає необхідних дозволів для перегляду цього вмісту.',
                'title'   => '403 Заборонено',
            ],

            '500' => [
                'message' => 'Упс! Щось пішло не так. Здається, у нас виникли проблеми з завантаженням сторінки, яку ви шукаєте.',
                'title'   => '500 Внутрішня помилка сервера',
            ],

            '503' => [
                'message' => 'Упс! Здається, ми тимчасово припинили роботу для технічного обслуговування. Будь ласка, поверніться через деякий час.',
                'title'   => '503 Служба недоступна',
            ],
        ],
    ],

    'shop' => [
        'customer' => [
            'addresses' => [
                'create-success' => 'Вашу адресу успішно створено.',
                'delete-success' => 'Вашу адресу успішно видалено.',
                'update-success' => 'Вашу адресу успішно оновлено.',
            ],

            'accounts' => [
                'create-success'     => 'Ваш обліковий запис успішно створено.',
                'delete-success'     => 'Ваш обліковий запис успішно видалено.',
                'logged-in-success'  => 'Успішний вхід.',
                'logged-out-success' => 'Успішний вихід.',
                'update-success'     => 'Ваш обліковий запис успішно оновлено.',

                'error' => [
                    'credential-error'  => 'Надані облікові дані невірні.',
                    'invalid'           => 'Невірна електронна пошта або пароль',
                    'password-mismatch' => 'Поточний пароль не відповідає.',
                    'update-failed'     => 'Під час оновлення вашого облікового запису виникла помилка',
                ],
            ],
        ],

        'checkout' => [
            'billing-address-saved'   => 'Адресу збережено успішно.',
            'check-billing-address'   => 'Будь ласка, перевірте адресу для оплати.',
            'check-shipping-address'  => 'Будь ласка, перевірте адресу для доставки.',
            'minimum-order-message'   => 'Мінімальна сума замовлення: :amount.',
            'order-saved'             => 'Замовлення успішно збережено',
            'payment-method-saved'    => 'Спосіб оплати збережено успішно.',
            'shipping-method-saved'   => 'Спосіб доставки збережено успішно.',
            'specify-payment-method'  => 'Будь ласка, вкажіть спосіб оплати.',
            'specify-shipping-method' => 'Будь ласка, вкажіть спосіб доставки.',

            'cart' => [
                'item' => [
                    'empty'           => 'Ваш кошик порожній.',
                    'error'           => 'Елемент у кошику не знайдено.',
                    'inactive-add'    => 'Неактивний товар не можна додати до кошика.',
                    'invalid-product' => 'Ідентифікатор продукту недійсний.',
                    'success'         => 'Товар успішно додано до кошика.',
                    'success-remove'  => 'Товар успішно видалено з кошика.',
                ],

                'quantity' => [
                    'illegal' => 'Кількість не може бути менше одного.',
                    'success' => 'Товар(и) в кошику успішно оновлено.',
                ],

                'coupon' => [
                    'apply-issue'    => 'Код купона не може бути застосований.',
                    'invalid'        => 'Недійсний код купона.',
                    'success-remove' => 'Купон успішно видалено.',
                    'success'        => 'Код купона успішно застосовано.',
                ],

                'move-wishlist' => [
                    'success' => 'Товар успішно перенесено в список бажань.',
                ],
            ],
        ],

        'wishlist' => [
            'moved'          => 'Товар успішно перенесено в кошик.',
            'option-missing' => 'Параметри товару відсутні, тому його не можна додати до списку бажань.',
            'removed'        => 'Товар успішно видалено зі списку бажань',
            'success'        => 'Товар успішно додано до списку бажань',

            'error' => [
                'security-warning' => 'Виявлено підозрілу активність!',

                'mass-operations' => [
                    'resource-not-found' => 'Вибраний товар у списку бажань не знайдено.',
                ],
            ],
        ],

        'sales' => [
            'orders' => [
                'cancel' => 'Замовлення скасовано успішно.',

                'error' => [
                    'cancel-error' => 'Замовлення не може бути скасоване.',
                ],
            ],
        ],

        'catalog' => [
            'products' => [
                'configurable-error' => 'Будь ласка, виберіть принаймні один конфігураційний атрибут.',

                'reviews' => [
                    'create-success' => 'Ваш відгук успішно надіслано.',
                ],
            ],
        ],

        'errors' => [
            '404' => [
                'message' => 'Упс! Сторінку, яку ви шукаєте, відпочиває. Здається, ми не можемо знайти те, що ви шукаєте.',
                'title'   => '404 Сторінка не знайдена',
            ],

            '401' => [
                'message' => 'Упс! Здається, вам не дозволено доступ до цієї сторінки. Виглядає, що вам не вистачає необхідних облікових даних.',
                'title'   => '401 Не авторизовано',
            ],

            '403' => [
                'message' => 'Упс! Ця сторінка закрита для вас. Здається, у вас немає необхідних дозволів для перегляду цього вмісту.',
                'title'   => '403 Заборонено',
            ],

            '500' => [
                'message' => 'Упс! Щось пішло не так. Здається, у нас виникли проблеми з завантаженням сторінки, яку ви шукаєте.',
                'title'   => '500 Внутрішня помилка сервера',
            ],

            '503' => [
                'message' => 'Упс! Здається, ми тимчасово припинили роботу для технічного обслуговування. Будь ласка, поверніться через деякий час.',
                'title'   => '503 Служба недоступна',
            ],
        ],
    ],
];
